tap "cloudfoundry/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "pivotal/tap"
tap "thoughtbot/formulae"
brew "autoconf"
brew "autojump"
brew "automake"
brew "bat"
brew "coreutils"
brew "openssl"
brew "fzf"
brew "git"
brew "gnupg"
brew "go"
brew "gradle"
brew "httpie"
brew "jenv"
brew "jq"
brew "libtool"
brew "maven"
brew "mongodb"
brew "neovim"
brew "nnn"
brew "nvm"
brew "openssl@1.1"
brew "pandoc"
brew "pkg-config"
brew "rabbitmq"
brew "rename"
brew "ripgrep"
brew "ruby"
brew "task"
brew "tmux"
brew "vim"
brew "zsh"
brew "watch"
brew "moreutils"
brew "pivotal/tap/springboot"
brew "vifm"
brew "thoughtbot/formulae/rcm"
cask "docker"
cask "font-hack-nerd-font"
cask "gitkraken"
cask "intellij-idea"
cask "iterm2"
cask "java"
cask "java8"
cask "postman"
cask "qlmarkdown"
cask "rabbitmq-app"
cask "robo-3t"
cask "visual-studio-code"
cask "keystore-explorer"
