tap "adoptopenjdk/openjdk"
tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "koekeishiya/formulae"
tap "mongodb/brew"
tap "morantron/tmux-fingers"
tap "nikitabobko/tap"
tap "noahgorstein/tap"
tap "robscott/tap"
brew "glib"
brew "harfbuzz"
brew "libtiff"
brew "openjdk"
brew "ant"
brew "jpeg-xl"
brew "atuin"
brew "bash"
brew "libgit2"
brew "bat"
brew "coreutils"
brew "python@3.13"
brew "ddgr"
brew "dive"
brew "erlang"
brew "eza"
brew "fd"
brew "unbound"
brew "gnutls"
brew "leptonica"
brew "tesseract"
brew "ffmpeg"
brew "fnm"
brew "fx"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-xargs"
brew "glow"
brew "gnupg"
brew "go"
brew "gron"
brew "gum"
brew "helm"
brew "htop"
brew "httpie"
brew "ical-buddy"
brew "jfrog-cli"
brew "openjdk@21"
brew "jmeter"
brew "jq"
brew "jsonnet-bundler"
brew "jwt-cli"
brew "k9s"
brew "kubernetes-cli"
brew "kubectx"
brew "lazydocker"
brew "lazygit"
brew "maven"
brew "miller"
brew "neovim"
brew "newsboat"
brew "node"
brew "onefetch"
brew "openjdk@17"
brew "openstackclient"
brew "parallel"
brew "pinentry-mac"
brew "pipx"
brew "qemu"
brew "ranger"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "rust"
brew "sesh"
brew "shellcheck"
brew "sponge"
brew "starship"
brew "stow"
brew "tmux"
brew "trash-cli", link: true
brew "tree"
brew "up"
brew "watch"
brew "wget"
brew "yarn"
brew "yazi"
brew "ykman"
brew "yq"
brew "zimfw"
brew "zoxide"
brew "zplug"
brew "felixkratz/formulae/borders"
brew "hashicorp/tap/terraform"
brew "mongodb/brew/mongodb-database-tools"
brew "morantron/tmux-fingers/tmux-fingers"
brew "noahgorstein/tap/jqp"
brew "robscott/tap/kube-capacity"
cask "adoptopenjdk8"
cask "aerospace"
cask "chatgpt"
cask "cyberduck"
cask "docker"
cask "firefox"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-iosevka-term-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-pro"
cask "font-sketchybar-app-font"
cask "ghostty"
cask "google-cloud-sdk"
cask "homerow"
cask "intellij-idea"
cask "iterm2"
cask "keystore-explorer"
cask "memoryanalyzer"
cask "microsoft-auto-update"
cask "obsidian"
cask "postman"
cask "raycast"
cask "robo-3t"
cask "sf-symbols"
cask "studio-3t"
cask "visual-studio-code"
cask "webstorm"
cask "wezterm"
vscode "browserstackcom.nightwatch"
vscode "codium.codium"
vscode "docker.docker"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "humao.rest-client"
vscode "loiane.java-spring-extension-pack"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.live-server"
vscode "redhat.java"
vscode "ryanluker.vscode-coverage-gutters"
vscode "shengchen.vscode-checkstyle"
vscode "sonarsource.sonarlint-vscode"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
