tap "adoptopenjdk/openjdk"
tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "koekeishiya/formulae"
tap "mongodb/brew"
tap "morantron/tmux-fingers"
tap "nikitabobko/tap"
tap "noahgorstein/tap"
tap "robscott/tap"
tap "sst/tap"
tap "thezoraiz/ascii-image-converter"
brew "openssl@3"
brew "readline"
brew "sqlite"
brew "xz"
brew "tree"
brew "ansible"
brew "glib"
brew "harfbuzz"
brew "libtiff"
brew "openjdk"
brew "ant"
brew "jpeg-xl"
brew "atuin"
brew "bash"
brew "libgit2"
brew "bat"
brew "blueutil"
brew "ccls"
brew "clipboard"
brew "coreutils"
brew "ddgr"
brew "dive"
brew "erlang"
brew "eza"
brew "fd"
brew "unbound"
brew "gnutls"
brew "leptonica"
brew "tesseract"
brew "ffmpeg"
brew "figlet"
brew "fnm"
brew "fx"
brew "fzf"
brew "node"
brew "gemini-cli"
brew "gh"
brew "git"
brew "git-delta"
brew "git-xargs"
brew "glow"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "gpatch"
brew "gradle"
brew "gron"
brew "gum"
brew "helm"
brew "htop"
brew "httpie"
brew "ical-buddy"
brew "jfrog-cli"
brew "openjdk@21"
brew "jmeter"
brew "jq"
brew "jqp"
brew "jsonnet-bundler"
brew "jwt-cli"
brew "k9s"
brew "kubernetes-cli"
brew "kubectx"
brew "lazydocker"
brew "lazygit"
brew "lolcat"
brew "lsd"
brew "lua-language-server"
brew "luarocks"
brew "maven"
brew "miller"
brew "neovim"
brew "neovim-remote"
brew "newsboat"
brew "onefetch"
brew "openjdk@17"
brew "openstackclient"
brew "pandoc"
brew "parallel"
brew "pinentry-mac"
brew "python@3.13"
brew "pipx"
brew "poppler"
brew "pyenv"
brew "pyenv-virtualenv"
brew "qemu"
brew "qsv"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "rich-cli"
brew "ripgrep"
brew "rust"
brew "rustup"
brew "sesh"
brew "shellcheck"
brew "sponge"
brew "starship"
brew "stow"
brew "stylua"
brew "syncthing"
brew "tealdeer"
brew "tmux"
brew "trash-cli", link: true
brew "uv"
brew "watch"
brew "wget"
brew "xan"
brew "xclip"
brew "xsel"
brew "yarn"
brew "yazi"
brew "ykman"
brew "yq"
brew "zimfw"
brew "zlib"
brew "zoxide"
brew "zplug"
brew "felixkratz/formulae/borders"
brew "hashicorp/tap/terraform"
brew "mongodb/brew/mongodb-database-tools"
brew "morantron/tmux-fingers/tmux-fingers"
brew "robscott/tap/kube-capacity"
brew "sst/tap/opencode"
brew "thezoraiz/ascii-image-converter/ascii-image-converter"
cask "adoptopenjdk8"
cask "aerospace"
cask "antigravity"
cask "basictex"
cask "chatgpt"
cask "claude-code"
cask "cyberduck"
cask "docker-desktop"
cask "drawio"
cask "espanso"
cask "firefox"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-iosevka-term-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-pro"
cask "font-sketchybar-app-font"
cask "gcloud-cli"
cask "ghostty"
cask "homerow"
cask "intellij-idea"
cask "iterm2"
cask "jordanbaird-ice"
cask "keystore-explorer"
cask "memoryanalyzer"
cask "microsoft-auto-update"
cask "mongodb-compass"
cask "obsidian"
cask "postman"
cask "raycast"
cask "rider"
cask "sf-symbols"
cask "studio-3t"
cask "visual-studio-code"
cask "warp"
cask "webstorm"
cask "wezterm"
cask "whatsapp"
cask "windsurf"
vscode "browserstackcom.nightwatch"
vscode "codium.codium"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "humao.rest-client"
vscode "loiane.java-spring-extension-pack"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.live-server"
vscode "pdconsec.vscode-print"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "ryanluker.vscode-coverage-gutters"
vscode "shengchen.vscode-checkstyle"
vscode "sonarsource.sonarlint-vscode"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
go "golang.org/x/tools/cmd/callgraph"
go "github.com/joe-elliott/cert-exporter"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/davidrjenni/reftools/cmd/fillswitch"
go "github.com/onsi/ginkgo/v2/ginkgo"
go "github.com/abice/go-enum"
go "mvdan.cc/gofumpt"
go "golang.org/x/tools/cmd/goimports"
go "github.com/twpayne/go-jsonstruct/v3/cmd/gojsonstruct"
go "github.com/golangci/golangci-lint/v2/cmd/golangci-lint"
go "github.com/segmentio/golines"
go "github.com/fatih/gomodifytags"
go "github.com/abenz1267/gomvp"
go "golang.org/x/tools/cmd/gonew"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "gotest.tools/gotestsum"
go "golang.org/x/vuln/cmd/govulncheck"
go "github.com/gonetx/httpit"
go "github.com/koron/iferr"
go "github.com/josharian/impl"
go "github.com/tmc/json-to-struct"
go "go.uber.org/mock/mockgen"
go "github.com/kyoh86/richgo"
cargo "despell"
cargo "tree-sitter-cli"
